{
    "career": [
        {
            "title": "Fullstack developer - TechStackApps",
            "date": "(Jun 2022 - present)",
            "description": "Gained valuable experience working on diverse projects, where I was responsible for implementing solutions based on client needs. I frequently interacted with clients to gather requirements, clarify project goals, and provide updates."
        },
        {
            "title": "Backend developer intern - TechStackApps",
            "date": "(Mar 2022 - Jun 2022)",
            "description": "Developed WordPress plugins and themes."
        }
    ],
    "projects": [
        {
            "title": "1. Financial Services Web Project",
            "description": "Developed a web platform where consultants could manage clients and generate insurance, investment, and other financial products. Primarily focused on front-end development, but also contributed to back-end.",
            "technologies": "Vue.js, TypeScript, Java, Spring Boot, MySQL"
        },
        {
            "title": "2. Energy Management Web App",
            "description": "Developed a web app for energy consumption monitoring and billing. Processed meter data, allowing our client to generate invoices and reports for their customers to view and download.",
            "technologies": "PHP, Laravel, MySQL, InfluxDB, Grafana, Docker, CI/CD"
        },
        {
            "title": "3. IoT Temperature Control System",
            "description": "Contributed to an IoT-based home temperature control system, focusing on MQTT device management. Handled device registration and communication between the mobile app and MQTT devices via RabbitMQ.",
            "technologies": "Node.js, MongoDB, Balena, RabbitMQ, Docker"
        },
        {
            "title": "4. Item Lending Platform",
            "description": "Developed the backend for a peer-to-peer lending app, including APIs for the mobile app and an admin dashboard to manage users, products, orders, customer issues, and more.",
            "technologies": "PHP, Laravel, Filament, MySQL, Docker, Minio, Pusher, Firebase, Traefik, Node.js, CI/CD"
        },
        {
            "title": "5. Health & Fitness App",
            "description": "Developed the backend of a health and fitness mobile application for companies. Supported core API functionalities, data management, and team-based features, allowing managers to oversee activities and manage teams.",
            "technologies": "PHP, Laravel, MySQL, Docker"
        }
    ],
    "quotes": [
        {
            "quote": "A cheerful heart is good medicine, but a crushed spirit dries up the bones.",
            "reference": "Proverbs 17:22"
        },
        {
            "quote": "Do not be wise in your own eyes; fear the Lord and shun evil.",
            "reference": "Proverbs 3:7"
        },
        {
            "quote": "In the world, you will have tribulation. But take heart; I have overcome the world.",
            "reference": "John 16:33"
        },
        {
            "quote": "For I know the plans I have for you, declares the Lord, plans for welfare and not for evil, to give you a future and a hope.",
            "reference": "Jeremiah 29:11"
        },
        {
            "quote": "My flesh and my heart may fail, but God is the strength of my heart and my portion forever.",
            "reference": "Psalm 73:26"
        },
        {
            "quote": "Come to me, all you who are weary and burdened, and I will give you rest.",
            "reference": "Matthew 11:28"
        }
    ]
}